"use client"

import { useState, useEffect } from "react";

export default function LandingPage() {
  const [timeLeft, setTimeLeft] = useState(900);

  useEffect(() => {
    const timer = setInterval(() => {
      setTimeLeft((prevTime) => (prevTime > 0 ? prevTime - 1 : 0));
    }, 1000);

    return () => clearInterval(timer);
  }, []);

  const formatTime = (time: any) => {
    const minutes = Math.floor(time / 60);
    const seconds = time % 60;
    return `${minutes}:${seconds < 10 ? "0" : ""}${seconds}`;
  };

  return (
    <div className="flex flex-col items-center justify-center min-h-screen bg-black">
      <div className="text-center p-6">
        <h1 className="text-4xl font-bold mb-4"></h1>
        <p className="text-xl mb-8 text-yellow-300">
          ψ̴̡̡̨̨̧̢̢̧̢̡̡̡̡̡̨̡̛̛̛͉̭̥̳͍͖͈̹̫̣̤͈̻̳̟͇͙͍̰̦͉̝̫͉̘̜͉̙̥͍̻̣̲̪͇̼̘̭̼̝̭̘̟̲̩̫̭̘̜͈͕̳̺̰̳͖̠̩̠̠̤̯̠̩̲̖͈̦̺̼̗̥͇͓̰͓̦̺̥͈͓̩͚͖̳̯͖͖̫̗͙̺̮͙̪͖͎̻̝̙͙̫̲̜̭͙͙͇̜̼̤̙̝̺̝̰̣͔̥̻̜͖̬̻̲͚͎̦̼̭̼͎͖̟͇̳̪͖̭͚̲͙̤̦͚̝́̅̓̀̒̀̉̄̓̑͛̈́̍̍͆̾͋͗̇͂̎̓̄͑̊͆̿̓͌͐̏̄̎͆̋͐͂̐̔̑̉̃̉̅͑͗́͆̾̏͊̃̏͛̄͌̅͂̓͐͐̊́̎̎̈́͐̓̉͗́̽̆͒͐́̾͂̈̅̐̊̍̽̈́̒̃͐̒̈́͆̑̋̀̈́̍̈̒͗̉́͐̑͂̒͗͑̍͑̂̒̈́́̿̀͋̆͑̄̑̒͆̑̓̏̓̓̓̓̃̿̌͛̂́̃͂́̒̐̈́͂͑͌̿͆̂͑͐͊͑̋̋̿͗͛̿̓̌̄̃̇͂̀̾̒̃̈́̾̎̓̐͗́̃̊̅̍̓͒̀̍͋̊̕͘̚͘̚̚̕̕͘̚̕̕͘̕̕̚͘͜͜͜͜͜͜͜͜͝͠͝͝͝͠͠͠͠͠͠͠͝ͅͅͅ ̴̡̡̢̡̢̡̢̢̧̧̧̧̡̨̨̡̧̧̨̧̡̥̻͍̠̠̪̻̼̙̱̜͔̜̰͖̲͎̜͖̜͚͕̮̯̗̰͙͓̩͇̯̺͓̪̺̗̘̱͓͕͉͈̼̭̥̘̙͕̝͎̱̭͖͍̖̱͉̭͕͔̞͓̳̱̹͓̟̜͈̪̦̳̮̠̘̺͈͇̘̤̯͙̦̮̙͕̬̻͔̪̟̺̗̝̜͎͔̲̯̗͈̤̰͙̬̱̭͇͍̺̘̻̻̗͕̘̪̬̝͉̯̲͈̪̹̳͔̱̮̳͓͈͕̤̟̖̟̙̙͉͙̦̳̯̞̤̟̫͈̲̩͇͎̲̟͙̙̘͖̙̭̞̳̥̭̬͙̩͓̦̞͎̝̫̯̳͔̪̭̫̼̞͕̣̳͉̗̫͕͖͚̩͕̼̥͍͙͈̭̩͚͙̫͖̮͈͉̰̘̝͉̹̅̈̈́̃̑̎͌̅̎̊̎̈́̃͆̏͗̔̏͑̋̐̓̽̇̋͒̑̋͆̿̂͛͐̈́̐̅͌̆̂̐̈̍̔̈́͆̊̿̇̃͛̍̉͋͒͒͐̋͐͛͛̐̐̚̚̕̚͘͘̚̕͜͜͜͝͠͝͝͠͝ͅͅͅͅͅͅͅψ̷̢̡̡̨̢̨̡̧̢̧̧̨̡̛̛͚̹̱͍͎̭͇̱̲̗̱͇̗͙̯̺̺̩̼̩̦̙̭̥͈̘̖͈͔͖̹̯̟̝̼̥͉̹͕͖͉̥̥̘͚͎̜̻̼͚̣͇̝̠͍̖̮̝̬̣̟̪̱̻̺̬̯͚̥͉̞̦͓͇̘̹̯̥̦̻͖͎̙͈͔̗̫͚̙̝͈̪͇͙̞̥̭͎̰͓̼̞̭͙͓̲̠͖̪̘̹̬̳̥͚̱͍̻͙̥̙͔͙̩͉̗̼̺̻̺̥͈͓̝̫͎̺͆̌̀̅̎̉́̓̔̇̀̇̇̈̊̾̄̏̏̓̐̔̉̄̅̿̆̿̀̐̈́̀̌̀̾̐̈́̔͗̐̎̉̓̆̆̓̋͂̇͋̑̈́̏̾̇̀̓̋́̃̄͛̓͑͌̆̓̑͑̃͒̊̽̃͑̓̌̅̇̎̃͊́̐͐̑̈́͋̊̽̊́̃̃̾̆̇̏̅͋͆̈́͋̓̈̊̈́̊̑̾͆̃́͒̀͒̾͊̓̈̊̍̅̅̏̀̽͋̎̎̈́͂͆͒̒́̀̒̃͒̌͗̔̈́̓̎͆̊̈́̇̉̇͗̆̈́̾̀͊́͑̅̽̿̐̽̎̈͑̈́̋̌̂̃̇͋͊̅̔̐͒̈̏̍̂̇͐͌͐̈́͛͑̅̈́̿̓͂̐͊̈́̅̈̌͂̈́̅̇͛͌͂̆̀̓͑̉̎͗̒̔́̓̇̒͂͆̌̋̎̎͌̈́͑́̏̏͌̓̏̂̉̌̀̓̽͒͒͆̄̏͗̀̈́͊̓̔̅̈́̕̕̕͘̚̚͘̕̕̕̚̕̕̚̚̚̚̚̕͜͜͜͜͠͝͝͝͠͠͝͠͝͝͠͝͝͝͝͝͠ͅͅ ̴̨̨̢̧̡̢̢̨̡̨̨̨̢̧̢̡̢̡̡̡̛̛̛̛̛̹̙̩͔̟̺̼͔̯̯͔̹̺̩̫̪̤̟͎̻̲̜̜̪̤̣̞͇̦̮̮͚̜̮͚̯̻̪̹̲̤͍͔̭͕̫̻͖̝̲͖̥̤͙̳̪̻̞̲̬͓̭͙͍̫̹̦̤̰̮̼͕͓͕̠̠̳̣̠͙͖̰̗̖̜͖̬̙̞͔̦̝͔̘͚̫͎͖̯̮̲̮̘͙̪̜̰̙͈̠̱̦͙͇̗͉̲̘̥̮͎̯̝͎̼̳͔̘͇̻̼̫̗̺͚͙̜̟̭̺͙͈̜̫͕̯̗͈̉͆̈́͋̓̒̇̓̓̔̊͒͑̀͐͂̃̾͛͋̓̓͐̑́̓̓̌̒͒́̈́͑̔̽͐͂̓̓́̅͐́̋̃̄̑̌̋̃͂̇͂̽̆̈́̊̈́̈́̀̔́̇̅̌̌̅͛̎̋̀̈́̌̔͛̈́̎͐̊̈̃̒͗̀͑͌̑̈́̈́͛̓͆̽́̒͛̔́̆̂̃͛͊̓͂̉̀̓̒̿̓̎̎̄̋̄̊̅̈͛̽̒̄͂̈̿̋͋͌̓̒̓̓̐̓̊̊̃̉̋͑̇͘͘̕̕͘̕͘̕̚̕͘͜͝͝͝͝͠͝͝͠͝͠͠͝͝ͅͅļ̷̨̛̙̗̱̼͎̘͉͉̖̯̝̫̗͉̯̹̹̭̪͙̙̖̗̞̜͇̓͐̉́͛͊͗̅̋̀̊͆̌̅̓̄̂͛͊̆̃̓̍͛̈́̓̈͒̎̇͗̑̄͂͒̓͐̾̃͋̅͒͛̾̓̊͋̓͆̇̊̏̔̍̐̐̑̾́̿͆̐͋̑̔̉͑̓̅̓̑̽̄͐̅̽͋̉̄̂̈́̆̽̎͋͗̋̅̓̍̆̊̅̎̇̿̆̓̊͛̇͗̃̒̌̎͛͋̌̆͋̎͆̋̂̊́͛̃̈̒̇̀̄̌͆̎̾͊̿̐͒͋̐̅̐͒́̇̒͘͘̚̚̚̕̚̕͘̚̚͘̕͜͝͝͠͠͝͝͝į̵̧̢̧̢̡̡̢̨̡̢̢̨̢̨̧̡̨̡̡̢̨̨̡̛̤̟̰̘̱͕͚̥̭̺̜̩̻̫͔̫̥̱̳̹͖͓͓͎̖̘͔̭̖͔̱̤͔͎͇̰͖̰̲̭̰͕̝̲̮̯̞͓̦͚̗͓̻͖͇̮͖͚̹̯̭̬̱̹̥̱̠̩̻̮̠͎̠̜̪̯͙̹̱̻̩͇̦̤͓̮̦͕̤̯̯̯͚͙͚̼͎̥̞̖̪͚̺͖̮̣̙̬̻̙̤̜̞̬̞͖̫̻̼͓͙̮̻̙̱̝͖̬͙̲̖̗̖̳͖͓̦̮̱̜̬̪͓̥̝̞̯̥̫̟̝̘̼̱͈̥̲̹͕̦̤̗̫̳̭͓͉̗̻̼͈͇̱̬̣̤̘͔̼̟͓͎̹̜͈̺̘̣̫͚͔̻̟̲̩̹͓͔̗̟͉̘̰̠̘̲͉͖̞̬̟̳̯̺͚͔͇̲̻̜͖͖͈̺͎̰̘̗̬̯̟͍͖́͂̄̑̽̿̔̀̀͋͒̈́̔͒̉͛̾̔̒̔̌̐̉̈́̒͑̐̉̽͋̈́͊̌͘͘͜͜͜͜͜͜͜͜͝͝ͅͅͅͅͅͅͅͅͅb̵̧̨̧̢̡̢̢̧̢̡̨̨̛͓̮͙̰͚͈̤̗͍̳̯̱̜̯͇͙̫̯̤̣̩͇͇̺̬̣̪̲̺̦̤̪̜͕̱̲͕̗̦͈͎͙̪̲̳̲̦̻͍͍̫̘̩̜͙̼̠͉̤̱͉̺̥̺̪̼̜̙͚̬͕̮̫͕̼̱͖̰̉͊̄̌̾̇̐̄̌̎̿͗̀̉̋̂͗̌́̓͋̆̎̅̾͒̇̽̉͐̒̈̈́̽̓͆͘̕̕̚͜͜͜͜͝͝ͅͅe̷̢̨̡̨̢̡̨̢̨̨̢̧̛̗̬̼̬̪͚̪̺̬̰̣̻̗̺̼̯̲̥̝̺̖̣̭̳̳̪͉͈͎̘̥͎̩̠̤̺̞͙͙͚͍̬̻̣̖͈̻̯̗͉̖͕̠̼̥̬̙̭͓͚̹̩̱͈̩͚̲͈̬̤̹͈̯̙̭͉̬̭̮̪̠͔̣̩͖͉͙̜̬̯̦̺̩͖̻͕̼̖̝̠̱̼̟͉̫̳̯͍̗͓̦̙͚͇̮̘͚̩̱̬̫̠̝͚̦̙͕̥̭̔̊͂̑̑̄͊̇̓̂̑̅̀̃̽͋͌̋́́̄̿̚̕̚͜͝͝͝ͅr̷̨̨̨̡̧̨̡̢̡̨̧̨̢̨̨̨̢̧̧̛̛̛̘̠͎̳̦̝̖͉̭̯͉͍̫͚̖̰̫͇͚̻̫͙̦̮̙̫̪͓̱͍̙͖̳̜͓̞̬͇̥̳͓͕̻̞̯̰͔͙̞̼̯̯̻̣͎͕̼̻̹̙͔̟͔̹̙̲̮͎̗̬̖̗̟̤̺̟̝͎̗̠̣͙̜͙̰͓̙̗̣͔̯̥̗̘͇̱̱͎̗̤̼̤͕͙͕̺̱̖̯͓̜͉͉̬̞̲̟͚͈̯͙̟̥͉̯̘̳̜̻̯̺̝̞̖̖͍̥̰̜̻̲̪͕͇̭̗͎̭͉̯͎͍̩̖̣͙̟̪̳̝͙͙̜͖͉͉͎̘̼͙͖̩̯͔͚̺̬̮̬̦̫̣̬̣͉̙̦̭̪͈͉̯̤̪͙͖̫̹̣̣̩̩͈̒̑̇́̏̿͊͗͊̌́̈́͑̿͒̐̈̈̈̇͂̔̂́͗̇̒̔͊̓̐͆́́̾̓̑̓̎͛͒̔̊̀̃͌͌̋̽̐̃̂̈́́̈̑̍͆̔̀̃̉̓̈́̐̅̿̆͆̊͂̆͌̆͐̊̾̒͂͌̀́̀̀̈́̉̇̇̎̆̈́̇̾̏͊͐̍̌̈́̚̚̚̚͘̚͜͜͜͜͝͝͝͝͝͠ͅȩ̴̨̢̧̢̨̢̧̡̢̡̛̛̛̼͎̱͔͎͖̺̰͉̯͇̹̲͇̣̟̬̘̳̹͔̗̫̙̙̺̦͖̙̣̺̹̥̬̲̞͉̳͔̥̺͕͙̠͍̬͙̙̞̮̼͍͔̝̼͍̜̭̼͖̫̺͙̻̻̙̞̖͈̱̩̗̱̮͈͉̫̟̤̘͚͇͓̘̭͚̤̩͚̫͔̮̰̥̝̘̟̹͍͈̰̰̥̹̲͓̭̇̿͑̓̀̄́̾̄̓̏̆͐̂͑̇̾̈̽̌̎͆̈́̔̋̀͗̀̇͆͌̎̓͐͗͆̓̀́͒̽̇͆̍͛̉̍͗̿̇̃͑̔͌̊̔̍̏̈̀̊͋̒̒͋̓͒̄̽̀͆̇̆͑͐̽̓̌̒̐̐͑̆͂̉̃̽̌͑̂͒͆̌̎̌̌͘̚̕̕͘̚͜͜͝͝͠͝͝͝͝͝͠͠͝ͅͅͅͅr̷̨̧̨̢̨̢̧̢̡̨̢̢̧̢̧̡̧̨̢̢̨̡̢̢̧̢̡̡̧̛̛̛̛̛̛̛̛̛̛̯̰̪̯̹͚̜̺͕̭̰̙̙̬͈͈̻̤͓̩̱̤̦̞̦̹̘̫̼̖̻̻̲͎̞̭̫͚͉̘͖͚̖̲͍̬͙͕̯̱͎̻̝̼̮̹͓̠͉̜̬̖͕̪̻͙̠͉̠͉̠̲̝̬̟͉̞͓̠̰̞̳̯̺̥̟̣̮̺̦̗̼̗͔̪̹͙̰̳͍̗̻̝̫͈̗̦̹̦̼̪̻̱͈͈̰̞͖͉͇̩̝̯͍̳̞͎͕͙̝̪̹̭̜̣͖̲̪͔͉͎͕̤̣̺̬͔͕̗̼̠̻̟͖̗̱̬͉͕͙̹̗̤͕̯͎͙̜̥͚̱̯̤̮̼̺̼̤͇͕̰̠͎̻̙̫̻̗̼͉̯̞̼̳̳̗̯̱̣̲̗͓̭̳̤̬̰̠̼̝̬͇̼̠̩̜̭̙̩͙̞̣̺̭̰̝̘̳͖̣̝̗̀̇͌̋̆̌̉̈́̓͆́̒͑̆̈̇̍͛͐͌͒̎̄̓̐̅̎͗̈́̀̆̓͑̉̏̒̌̔͒̌͋̒̔̎̌͂͋͆̊̋̿͂̔̃͛̐͋̀̌͛͆̂̂̔̉̀̽̾̈͛̽̀̐͂̀͑̓̔̀̈́̅͂̑̈̔̈͐̈̋̈́͐̈̀͌̀̀̏͛̄̌͆̿̏̑͋̄́͂̔̏̃́͋̌̏̀͊̉́̓̈́̽͆̒̈̍̾̓̔͐́͗̔͋̐͂̒͗̍̎̎̓́̽̒͋͂̑̾̃́̽̆̓̅͐͒̒́̐͋̌̐͒͐̑́̉͐̔͌̀̂̓́̈͆͑́̔͋̐̽̊͒̓͒̈́̀̅͑̐͛̀͑͋̂̈̽͋͊̽́̅̀̀̔̂̈́̓̄̊̾̂̒̔̓͗̅̈́̓̀͌͛̔̚̚͘̚͘͘̕̚̚̚̚̕̚̕̚͘̕͘̚̕̕̕̚͘̚͜͜͜͜͜͜͝͝͝͠͝͝͠͝͠͝͠͠͝͠͝͠͠ͅͅͅͅͅͅ ̵̢̡̢̢̨̡̨̧̡̧̢̧̧̨̨̨̢̨̢̧̡̨̡̨̢̛̛̛̛̛͕͙̺͖͖̜̯̝̤̱̺̣̫̰͍̺̞̖̘̣̫̠̺̲̟̬̘͚̘͔̯͙̦̭̹͍̳͖̼͚̝̱͓̺͚̪̱̲̼̳̯͈̣̤͙̪̮̜͍̱̯͈̻̭͕̲̫͇͕͇̱͖͈̦̺͙̱͙͇͔͍̦̞͍̟̼̥͇͖̪̣̘͓̮̬̠͓̥̜̪̳̖̟̜̬͕̜̝̙̺̟̮̜̖͉̱̹̝̝̤͈͙̪̳̘͍̙̦̻̲̲̮̰͉͎̟̭̺̹͚̟͖͕͉̯̣͙͇̟̥̝͈͕̼̱̣̝͈̣͎̺̬̹͕̤̘͔̥̩̝̼̪̠͕̦͍̼̮̯̲̫͙̫̘̙̣̖̮͙̬̬͚͎̖̪͕̜͇̮̻͓͇̻̮̩͈̬̤̬̖̻̤͓̣͎̼͕͎̥̳̲̳̖̜̳͉̖͖͇̼͈͍̜͇͙̟̻̥̱͙̹̬̰̩̤͍̭̼͓̯̜͈̦̓̐̍̌͌̇͐̏̓̒͒͆̋̉̉̿̾̅̀̇͊͂̆͑̈́͐̂̔̀̑̿̿̽͐̆́̿͂̽̂͂͐̇̉͊̓̍̾̀͂́́̾̈͛̐̊͐͒̊̄͒̍̉̀́̈́͒̌̓̾̈́̀́͗̇̉̆͐̃͂̈́̓̉̈́̈͂̋͒́̅͆͂̾̋̃̆̉̀̏̊̎̓̀̍̀̽́̑̏̏͂̎͊̈͋͌̔͌̑͋̎͐͊̎̽̏̍̋̇́̾͒̂͗̏͑̋̔̃̄̄̈́͆͆̀̀̿́͗̇̂̄͐͋̾̓͛͑̈̏̍̈́̈̿͒̉̑̇̈́́͂̑̒̌̈͊̿̾̓̾̈́̐̈́̈̇͋̽͐̑͗̒̎̏̔̿͗̓̐̊̔̈̓̆̈͛̽̈͑͛͛̔̓͊́̉͋̔̒͐̌̾́͌̕͘̕̕̕̕̚͘͘͘̕͘̚͜͜͜͜͜͜͜͜͠͝͝͝͝͠͠͠͠͝͝͝͠͠͠͝ͅͅͅͅͅm̵̧̧̧̛̛̛͕͖̤̼̜͍̭̙̬̪̱̖̳̺̭̮̳̼̱͓̻͚̟͈̟̝̻͍̪̰͙̰͉͍̻͚̦̘̱̯̙̱͓̪̝̜̼̥̀̿̑͒͆͋͗́̌́̇̑̽̿̓͑́̽̒́͌̆̐̎̀̈́͋͂͆̓̇̀͂̈̍͂͂̇̎͑̎̏͗͊͛͐͆͂̑̇́͗̈́̈̽́̔͂͐͌̈́̿̃̈̋̐́̓̽̄̽͊̄̓̊̈́́̇̔͌̎͛̀̈́̋̏̊̊̌̽̃̆̔͛̍̿͐̓̀̑͊̂̐͑̒̾̔̅́̓͂̐̇͐͑̈̊͊̐̂̈́͛̏͒̂̽͆̏̽͗͂̐͑̔̾̈́̓̎͛̋́̈́͆̆̉̇̏̍͛̒́͋̉͒͂̅̂̆͘͘̚͘͘̚̕̚̚͜͜͠͠͝͝͝͝͠͠͠ͅơ̶̧̢̧̢̡̢̢̞̯̲̺̩̠̱̜̪̥͇͙̭͍̖̩̰̹͓̺̪̝͚͓͍̤͍͎̖̹̭͎̳̠͔̗̪̜̬̗͍̬̟̰̗̯̦̲͙̟̱͎̰̻̤̗̜̦͇̘̎͊̂̂͊̆̑̾̍͒̐͊̀̊̎̈̄̈́̄̕͜͜͠͝͝͝͝ͅì̸̡̡̡̡̨̧̨̡̡̧̢̧̧̢̢̡̨̡̧̡̨̢̡̧̡̨̧̧̛̛̗͈̭̲͎̻̖̟̬̱̳͇͙͚̠͍̦̥̘͙͔̲̟̟̙̥͇̗̙̝̜̗̲̣̘̖̮̙̜̠̪͙̣̟͎̗̫̹̘̹͓̰̘̼̭̬͉̞̱̩̘͇̜̮͈̖̟̤̲̲̺̫͓̤̹͕̬̱͎̜̩̱̟̝̻̘͈̦̞̜̯͚͖̟̱͈̝̣̰̩͕̭̘̮̞͔̪̥̳̤̪̟̳̰͈̫͎͈̘̣̘̯̯̯̭̺̺͓̰͇̲̱̮͔͉̺͍̘͉͎̱̳̗̣͔͓̳̖̼̘̤̰͍̬͈͙̪̠̺̰͉̪̘̱̣̗̖̼̳͉͓͈̤͍̫̭͖͍̙͇͈̥̯̭̩̥̘̯̜̰̗̠̟̖̱̭̜͚͖̻̤͖̩̝̳̜͖̩͈͎̒́͂̈́̈́̈́̈́͛̓͆͗̐͑̽̈́̀͋́̈́̍̓̑̔̊̈́̈́̆̋̈́͛͂̅͋́̃̑̈́͐̄̋͋̂̃͊̇̇͋͌̇̔̎͑͑̎̈́͌͆̆̓́̋̓̋͒̏́͌̑̀̇̒͊̆͋̾̀̒̌̓͑̾̃̔͘̕͘̕̕̕̚͜͜͠͝͝͝͝͠͝͠ͅͅͅͅͅͅ ̵̡̨̡̢̡̡̡̢̢̧̧̢̧̨̡̛̛̛̛̩͇̝̺̬͙̭͚͎̫̟̫̳̩̟͉̲͈̩̭̣͚̜̥̹͇̙̻̮̝̭̫͈͔̤̳̗͖̠̹̭͔̱̺̤̟͙̣͎̤̬̰͓͔̼̪͈̮̦̯͈͈͈̮̯͖̦͔̼̠͚̫̥͓̝͇͔̲͔̲̰̮̥̣̱̣̜̪̯̹͖̟̫̩̖̯̮͕̫̞̫̘͉͚͉͙͉̗͎̲̺͈̥̩̻̠̻̺͌́͗͑́̽͆͐̆͋͂̿̈͂̑́̾̀͛̎̀̿̀͊̆́̅́̏͋̿͆͆͊̾̈́̂̑̽̀̒̈̽͑̉͆̒̐̔̿̈́̽̋̉̈̀̽̌͗̌͋̓̑̅͊̎̓̍͂̑̉̿̏̄̂̎̇̿̏̌̐̌̏̀̓̃̈́̓̕̚͘̚̚͜͜͜͜͜͜͝͝͝͝͠ͅͅͅ☠̶̨̢̡̨̧̢̨̧̢̢̡̢̨̨̧̧̛̛̛̛̛̛͚͎̱̹̣̼̩̙̹̦̺̥̜̩̟̠͙͇̠̩͖̰̗̞̙̭̱̭̺͕͍͚͕̳̗̠̱̲̭̹̪̱̜͙̭͓̭̪̮̱̥͚̰͖̤̖͖̣̱̗͈̯̙̬̘̻̯̫̩̬̝̖͖̜̮͔̤̫̪̗̰͔͕͍̥̘̣̣͕͕͕͙͍̘̦̘͈̥̳̯̰͉͓̫̦̫͓̞̟̖̞̾̈́͆̈́̓̑͂̓̎̎̓̽̃̈́͌̍̇̓͌͆͊̌͆́̿̎̄̋̈́͑̔̋̇̀̆̄̎̀̇͊͊́̎͂̈́̓͊̑̈́̆̉̀́̇̈́͆͌͒́̏̄̽̀̓̃̐̆̐̾̂̏̉̏̈͗̃̎̿̃͗̾̎̇̀̈́̆̐̌̔̏̊̓̽͑́̐̄̒̈́̇̈́́̊͌̾̈́̓̎̓͌̎̽́̾̌̓̈́̏̈̓̃͑̔͗̀̅̈̒̎̊̐̂́̂̍̐̓̅̉͆̌͗̊̈́̍͂͆̈̐͊̊̐̑͋́̓̄̂̈́̇͂͂̎͐͑̀̎͒͗͂̽̓͊̓̂̃̈́͐̽̓̽̈́̅̉͑̐̀͋̌͐̊͂̿̓͗̀̍̀̿̽̈́̔̎̆̊̅̇͛̀̿̄̌̔̎̐̃̑̒̎̃͑͊̀̈́͊̊̆͘̕̚̚̕̕͘̚͘̚̕̕̕̕͘͘̕͜͝͠͝͠͝͝͝͠͠͝͝͠͝͠͝ ̵̨̧̡̺̭̩̥̳̜̻̟̼̖͕̤̤̭̘͚̭͎̘̖̳̜̝̭̠̻͍̯̤̀͋ͅͅͅͅ☠̵̧̡̛̛̛̛̛̛͉̩̜̯̺̼̮̻͈̻̰͚͎̺̹͖̻͍͓̞͙̮̙̱̝̙̬̣̪͖̱̬̳̱̹̞̦͇̖̪̪̙͕̰̮͕̃̔̐̌̇͛́͂͒̾́́̌̎̽̑͋̿̏̄̀̄͛͋̽̃͋̈́̆̅͛͐̈̅̋̉̔͑̑̅̀͋̏̑̎̏̈́̄̀̏̆͆̌̂̏́̒͛̀̑̄̐̃̃̎̌̊̓́̃͛̾̆̀́̎̊̀͑̉̏̀̋̔̐̍̆́͆̑̇͐̎̔͗̈́̓̊̈̓́̑̽̀̐̃̄̌̑̃̎̒̐͂̎̀̅̈́̑̈́͑̂̿̔̈́̐̈́́̃̎̿̽̈́̈́͋͂̇̾͆̅͊͋̀̅̄̄͌̽̈̌̍͆̈̍̅͂̒́̔̈̑͑̾͆̎̆͋̄̐͋̍̌͂̓̓̂́̆͆̑̔̄́́͒̇̄̀̿̊̌̏͒̈̽͌̊͒͗͛̔̃͑̆̀̀̏̀͊̋̎̀͆́̀̈̓̈́̍̿̕͘̚͘͘̚͘̕̕̕̚̚̚͘͜͝͝͝͝͝͠͠͠͝͠͝͝͝͝͝͝͝
        </p>

        <div className="text-white text-3xl font-semibold px-8 py-4 rounded-lg shadow-lg">
          {formatTime(timeLeft)}
        </div>

        {/* <div className="mt-8">
          <button className="bg-yellow-500 hover:bg-yellow-600 text-white px-6 py-3 rounded-lg font-semibold">
            Subscribe Now
          </button>
        </div> */}
        <p className="text-black">Ce que ██████ a annoncé au sujet des guerres et des famines se réalise à notre époque
Qu'est-ce qui le prouve ?
Les guerres
██████ a dit "Nation se dressera contre Nation et Royaume contre Royaume" ██████ 24 verset 7
Il y a eu plus de morts à cause des guerres à notre époque qu'à n'importe quelle autre époque
En 100 ans, entre 1900 et 2000, il y a eu 3 fois plus de morts à cause des guerres que pendant les 1900 années précédentes</p>
      </div>
    </div>
  );
}
